# 01. NULL 처리하기

In [2]:
import pandas as pd 
df1 = pd.read_csv('../datasets/ANIMAL_INS.csv')
df1['NAME'] = df1['NAME'].fillna('No name')
df1.sort_values(by=['ANIMAL_ID'])[['ANIMAL_TYPE', 'NAME', 'SEX_UPON_INTAKE']]

   ANIMAL_TYPE    NAME SEX_UPON_INTAKE
0          Cat   Sugar   Neutered Male
1          Cat   Jewel   Spayed Female
2          Cat     Meo   Neutered Male
3          Dog  Harley   Spayed Female
4          Cat     Gia   Spayed Female
..         ...     ...             ...
95         Dog    *Sam   Neutered Male
96         Dog  Jackie   Neutered Male
97         Dog   Benji   Spayed Female
98         Dog  Shelly   Spayed Female
99         Dog   Rocky   Neutered Male

[100 rows x 3 columns]

# 02. 가격이 제일 비싼 식품의 정보 출력하기

In [4]:
df2 = pd.read_csv('../datasets/FOOD_PRODUCT.csv', encoding='cp949')
df2.loc[df2['PRICE'] == max(df2['PRICE'])]

   PRODUCT_ID PRODUCT_NAME  PRODUCT_CD CATEGORY  PRICE
20      P0051      맛있는배추김치  CD_KC00001       김치  19000

# 03. 중복 제거하기

In [6]:
df3 = pd.read_csv('../datasets/ANIMAL_INS.csv')
df3 = df3.dropna(subset=['NAME'])
df3 = df3.drop_duplicates(subset=['NAME'])
pd.DataFrame([len(df3)], columns=['count'])

   count
0     96

# 04. 동물 수 구하기

In [8]:
df4 = pd.read_csv('../datasets/ANIMAL_INS.csv')
pd.DataFrame([len(df4)], columns=['count'])

   count
0    100

# 05. 이름에 el이 들어가는 동물 찾기

In [10]:
df4 = pd.read_csv('../datasets/ANIMAL_INS.csv') 
df4.loc[(df4['NAME'].str.lower().str.contains('el')) & (df4['ANIMAL_TYPE'] == 'Dog')].sort_values(by='NAME')

,ANIMAL_ID,ANIMAL_TYPE,DATETIME,INTAKE_CONDITION,NAME,SEX_UPON_INTAKE
13,A355753,Dog,2015-09-10 13:14,Normal,Elijah,Neutered Male
57,A382192,Dog,2015-03-13 13:14,Normal,Maxwell 2,Intact Male
73,A391858,Dog,2017-03-16 16:53,Normal,Nellie,Spayed Female
98,A414198,Dog,2015-01-29 15:01,Normal,Shelly,Spayed Female